# Dialysis machines
This Notebook makes an exploratory analysis the datasets found under `./dataset`

## Data Gathering
Load the local parquet files inside a Pandas `DataFrame`.

### Machine 1

In [14]:
import pandas as pd

df_machine_data_1 = pd.read_parquet("dataset/machine_data_1.parquet")
print(
    f"The machine 1 data set has {len(df_machine_data_1)} records with {df_machine_data_1.shape[1]} variables."
)
df_machine_data_1.head()

The machine 1 data set has 3832 records with 7 variables.

,machine_id,date,num_treatments,hours_of_operation,alarms,num_warnings,sensor_data
0,Machine_1,2023-06-01 09:46:28.611018,1,1.561568,None,0,0.747587
1,Machine_1,2023-06-02 09:46:28.611018,9,11.670001,None,0,0.725209
2,Machine_1,2023-06-03 09:46:28.611018,4,6.345075,High Temperature,1,0.773772
3,Machine_1,2023-06-04 09:46:28.611018,5,8.521391,None,0,0.728383
4,Machine_1,2023-06-05 09:46:28.611018,2,2.893482,None,0,0.780066

In [15]:
df_machine_data_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3832 entries, 0 to 2015
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   machine_id          3832 non-null   object
 1   date                3832 non-null   datetime64[ns]
 2   num_treatments      3832 non-null   int64
 3   hours_of_operation  3832 non-null   float64
 4   alarms              212 non-null    object
 5   num_warnings        3832 non-null   int64
 6   sensor_data         3832 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 239.5+ KB

In [28]:
df_machine_data_1.describe()

,date,num_treatments,hours_of_operation,num_warnings,sensor_data
count,3832,3832.000000,3832.000000,3832.000000,3832.000000
mean,2023-11-30 13:04:53.412688640,5.015919,7.550483,0.084812,0.749067
min,2023-06-01 09:46:28.611018,0.000000,0.000000,0.000000,0.650922
25%,2023-08-31 09:46:28.611017984,2.000000,3.422165,0.000000,0.724079
50%,2023-11-30 09:46:28.611017984,5.000000,7.263182,0.000000,0.748959
75%,2024-02-29 09:46:28.611017984,8.000000,11.254956,0.000000,0.773948
max,2024-05-30 09:46:28.611018,10.000000,19.986752,3.000000,0.849826
std,NaN,3.114789,4.989390,0.437547,0.030140

### Machine 2

In [16]:
df_machine_data_2 = pd.read_parquet("dataset/machine_data_2.parquet")
print(
    f"The machine 2 data set has {len(df_machine_data_2)} records with {df_machine_data_2.shape[1]} variables."
)
df_machine_data_2.head()

The machine 2 data set has 3832 records with 7 variables.

,machine_id,date,num_treatments,hours_of_operation,alarms,num_warnings,sensor_data
0,Machine_1,2023-06-01 09:46:28.611018,10,16.739101,None,0,0.760686
1,Machine_1,2023-06-02 09:46:28.611018,9,15.811422,None,0,0.768058
2,Machine_1,2023-06-03 09:46:28.611018,9,17.964906,None,0,0.747932
3,Machine_1,2023-06-04 09:46:28.611018,9,17.250504,None,0,0.760337
4,Machine_1,2023-06-05 09:46:28.611018,7,8.173130,None,0,0.779009

In [17]:
df_machine_data_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3832 entries, 0 to 2271
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   machine_id          3832 non-null   object
 1   date                3832 non-null   datetime64[ns]
 2   num_treatments      3832 non-null   int64
 3   hours_of_operation  3832 non-null   float64
 4   alarms              189 non-null    object
 5   num_warnings        3832 non-null   int64
 6   sensor_data         3832 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 239.5+ KB

In [29]:
df_machine_data_2.describe()

,date,num_treatments,hours_of_operation,num_warnings,sensor_data
count,3832,3832.000000,3832.000000,3832.000000,3832.000000
mean,2023-11-30 18:24:40.886592512,4.900313,7.385393,0.066023,0.749981
min,2023-06-01 09:46:28.611018,0.000000,0.000000,0.000000,0.650346
25%,2023-09-01 03:46:28.611017984,2.000000,3.138912,0.000000,0.725018
50%,2023-12-01 09:46:28.611017984,5.000000,7.141561,0.000000,0.749867
75%,2024-02-29 09:46:28.611017984,8.000000,11.129289,0.000000,0.774962
max,2024-05-30 09:46:28.611018,10.000000,19.952270,3.000000,0.849033
std,NaN,3.156077,5.053911,0.374847,0.030316

### Machine details

In [18]:
df_machine_details = pd.read_parquet("dataset/machine_details.parquet")
print(
    f"The machine 2 data set has {len(df_machine_details)} records with {df_machine_details.shape[1]} variables."
)
df_machine_details.head()

The machine 2 data set has 10 records with 4 variables.

  machine_id     location    manufacturer    model
0  Machine_1     New York  Manufacturer_A  Model_X
1  Machine_2     New York  Manufacturer_C  Model_X
2  Machine_3  Los Angeles  Manufacturer_B  Model_Y
3  Machine_4  Los Angeles  Manufacturer_A  Model_Z
4  Machine_5      Phoenix  Manufacturer_C  Model_Y

In [19]:
df_machine_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   machine_id    10 non-null     object
 1   location      10 non-null     object
 2   manufacturer  10 non-null     object
 3   model         10 non-null     object
dtypes: object(4)
memory usage: 448.0+ bytes

### Maintainance Records

In [20]:
df_maintenance = pd.read_parquet("dataset/maintenance_records.parquet")
print(
    f"The machine 2 data set has {len(df_maintenance)} records with {df_maintenance.shape[1]} variables."
)
df_maintenance.head()

The machine 2 data set has 100 records with 4 variables.

   record_id machine_id                       date       description
0          1  Machine_4 2024-02-01 09:46:28.706811          Cleaning
1          2  Machine_4 2023-11-03 09:46:28.706820     Routine Check
2          3  Machine_5 2024-05-03 09:46:28.706824   Software Update
3          4  Machine_6 2023-11-29 09:46:28.706828          Cleaning
4          5  Machine_6 2023-09-21 09:46:28.706831  Part Replacement

In [21]:
df_maintenance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   record_id    100 non-null    int64
 1   machine_id   100 non-null    object
 2   date         100 non-null    datetime64[ns]
 3   description  100 non-null    object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 3.2+ KB

In [30]:
df_maintenance.describe()

        record_id                           date
count  100.000000                            100
mean    50.500000  2023-12-18 20:05:40.706987264
min      1.000000     2023-06-08 09:46:28.707030
25%     25.750000  2023-09-06 21:46:28.707064832
50%     50.500000  2023-12-24 21:46:28.706954496
75%     75.250000  2024-03-26 21:46:28.707016448
max    100.000000     2024-05-31 09:46:28.707070
std     29.011492                            NaN

## Duck DB

In [22]:
import duckdb

con: duckdb.DuckDBPyConnection = duckdb.connect(
    "dataset/dialysis_machine_data.duckdb"
)

con.sql("SHOW TABLES").show()

┌─────────────────────┐
│        name         │
│       varchar       │
├─────────────────────┤
│ machine_data_1      │
│ machine_data_2      │
│ machine_details     │
│ maintenance_records │
└─────────────────────┘

In [23]:
con.sql("SELECT * from machine_data_1").show()

┌────────────┬──────────────────────┬────────────────┬───┬──────────────────┬──────────────┬────────────────────┐
│ machine_id │         date         │ num_treatments │ … │      alarms      │ num_warnings │    sensor_data     │
│  varchar   │     timestamp_ns     │     int64      │   │     varchar      │    int64     │       double       │
├────────────┼──────────────────────┼────────────────┼───┼──────────────────┼──────────────┼────────────────────┤
│ Machine_1  │ 2023-06-01 09:46:2…  │              1 │ … │ NULL             │            0 │ 0.7475866187854373 │
│ Machine_1  │ 2023-06-02 09:46:2…  │              9 │ … │ NULL             │            0 │ 0.7252086602966215 │
│ Machine_1  │ 2023-06-03 09:46:2…  │              4 │ … │ High Temperature │            1 │ 0.7737720654425962 │
│ Machine_1  │ 2023-06-04 09:46:2…  │              5 │ … │ NULL             │            0 │ 0.7283830721465598 │
│ Machine_1  │ 2023-06-05 09:46:2…  │              2 │ … │ NULL             │            0 │ 0.7800660213924229 │
│ Machine_1  │ 2023-06-06 09:46:2…  │              5 │ … │ NULL             │            0 │ 0.7914934324893409 │
│ Machine_1  │ 2023-06-07 09:46:2…  │              3 │ … │ NULL             │            0 │ 0.7419389667385334 │
│ Machine_1  │ 2023-06-08 09:46:2…  │              5 │ … │ NULL             │            0 │ 0.7562439739769578 │
│ Machine_1  │ 2023-06-09 09:46:2…  │              2 │ … │ NULL             │            0 │ 0.7509224076125091 │
│ Machine_1  │ 2023-06-10 09:46:2…  │              6 │ … │ NULL             │            0 │ 0.7744325805083657 │
│     ·      │          ·           │              · │ · │  ·               │            · │          ·         │
│     ·      │          ·           │              · │ · │  ·               │            · │          ·         │
│     ·      │          ·           │              · │ · │  ·               │            · │          ·         │
│ Machine_1  │ 2023-10-06 09:46:2…  │              5 │ … │ NULL             │            0 │ 0.7612290966803859 │
│ Machine_6  │ 2024-02-17 09:46:2…  │              6 │ … │ NULL             │            0 │ 0.7645373426888238 │
│ Machine_2  │ 2024-03-21 09:46:2…  │              7 │ … │ clogged filter   │            1 │ 0.7392673464263863 │
│ Machine_10 │ 2023-10-21 09:46:2…  │              3 │ … │ NULL             │            0 │ 0.7790953037430053 │
│ Machine_7  │ 2023-10-08 09:46:2…  │              2 │ … │ Sensor Error     │            2 │  0.749789647935629 │
│ Machine_6  │ 2024-02-13 09:46:2…  │              4 │ … │ NULL             │            0 │  0.795938039378814 │
│ Machine_3  │ 2023-09-05 09:46:2…  │              6 │ … │ NULL             │            0 │ 0.7155189409288959 │
│ Machine_1  │ 2024-04-01 09:46:2…  │              1 │ … │ NULL             │            0 │ 0.7750044904491201 │
│ Machine_8  │ 2024-02-27 09:46:2…  │              4 │ … │ NULL             │            0 │ 0.7513410685159592 │
│ Machine_6  │ 2023-12-08 09:46:2…  │              9 │ … │ NULL             │            0 │ 0.7707379723879532 │
├────────────┴──────────────────────┴────────────────┴───┴──────────────────┴──────────────┴────────────────────┤
│ 3832 rows (20 shown)                                                                      7 columns (6 shown) │
└───────────────────────────────────────────────────────────────────────────────────────────────────────────────┘

In [24]:
con.sql("SELECT * from machine_details").show()

┌────────────┬─────────────┬────────────────┬─────────┐
│ machine_id │  location   │  manufacturer  │  model  │
│  varchar   │   varchar   │    varchar     │ varchar │
├────────────┼─────────────┼────────────────┼─────────┤
│ Machine_1  │ New York    │ Manufacturer_A │ Model_X │
│ Machine_2  │ New York    │ Manufacturer_C │ Model_X │
│ Machine_3  │ Los Angeles │ Manufacturer_B │ Model_Y │
│ Machine_4  │ Los Angeles │ Manufacturer_A │ Model_Z │
│ Machine_5  │ Phoenix     │ Manufacturer_C │ Model_Y │
│ Machine_6  │ Los Angeles │ Manufacturer_A │ Model_X │
│ Machine_7  │ New York    │ Manufacturer_B │ Model_Z │
│ Machine_8  │ Los Angeles │ Manufacturer_A │ Model_X │
│ Machine_9  │ Houston     │ Manufacturer_C │ Model_X │
│ Machine_10 │ New York    │ Manufacturer_C │ Model_X │
├────────────┴─────────────┴────────────────┴─────────┤
│ 10 rows                                   4 columns │
└─────────────────────────────────────────────────────┘

In [25]:
con.close()

## Data merging

In [26]:
df_machine_data = pd.concat([df_machine_data_1, df_machine_data_2])
df_machine_data.head()

,machine_id,date,num_treatments,hours_of_operation,alarms,num_warnings,sensor_data
0,Machine_1,2023-06-01 09:46:28.611018,1,1.561568,None,0,0.747587
1,Machine_1,2023-06-02 09:46:28.611018,9,11.670001,None,0,0.725209
2,Machine_1,2023-06-03 09:46:28.611018,4,6.345075,High Temperature,1,0.773772
3,Machine_1,2023-06-04 09:46:28.611018,5,8.521391,None,0,0.728383
4,Machine_1,2023-06-05 09:46:28.611018,2,2.893482,None,0,0.780066

In [27]:
df_machine_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7664 entries, 0 to 2271
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   machine_id          7664 non-null   object
 1   date                7664 non-null   datetime64[ns]
 2   num_treatments      7664 non-null   int64
 3   hours_of_operation  7664 non-null   float64
 4   alarms              401 non-null    object
 5   num_warnings        7664 non-null   int64
 6   sensor_data         7664 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 479.0+ KB

In [34]:
df_machine_data["machine_id"].unique()

array(['Machine_1', 'Machine_2', 'Machine_3', 'Machine_4', 'Machine_5',
       'Machine_6', 'Machine_7', 'Machine_8', 'Machine_9', 'Machine_10'],
      dtype=object)

In [36]:
df_machine_data_detailed = df_machine_data.merge(
    df_machine_details, how="left", on="machine_id"
)
df_machine_data_detailed.head()

,machine_id,date,num_treatments,hours_of_operation,alarms,num_warnings,sensor_data,location,manufacturer,model
0,Machine_1,2023-06-01 09:46:28.611018,1,1.561568,None,0,0.747587,New York,Manufacturer_A,Model_X
1,Machine_1,2023-06-02 09:46:28.611018,9,11.670001,None,0,0.725209,New York,Manufacturer_A,Model_X
2,Machine_1,2023-06-03 09:46:28.611018,4,6.345075,High Temperature,1,0.773772,New York,Manufacturer_A,Model_X
3,Machine_1,2023-06-04 09:46:28.611018,5,8.521391,None,0,0.728383,New York,Manufacturer_A,Model_X
4,Machine_1,2023-06-05 09:46:28.611018,2,2.893482,None,0,0.780066,New York,Manufacturer_A,Model_X

In [37]:
df_machine_data_detailed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7664 entries, 0 to 7663
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   machine_id          7664 non-null   object
 1   date                7664 non-null   datetime64[ns]
 2   num_treatments      7664 non-null   int64
 3   hours_of_operation  7664 non-null   float64
 4   alarms              401 non-null    object
 5   num_warnings        7664 non-null   int64
 6   sensor_data         7664 non-null   float64
 7   location            7664 non-null   object
 8   manufacturer        7664 non-null   object
 9   model               7664 non-null   object
dtypes: datetime64[ns](1), float64(2), int64(2), object(5)
memory usage: 598.9+ KB